gradhocJcalvo/optee-graddeck/core/arch/arm/plat-stm32mp2/scmi_server_scpfw.c
	return rstctrl_deassert_to(stm32_scmi_reset[index].rstctrl_be, to_us);
}

static const char *plat_scmi_reset_get_name(struct rstctrl *rstctrl)
{
	int index = rstctrl - plat_resets;

	assert(index >= 0 && (size_t)index < ARRAY_SIZE(stm32_scmi_reset));

	return rstctrl_name(stm32_scmi_reset[index].rstctrl_be);
}

static const struct rstctrl_ops plat_scmi_reset_ops = {
	.assert_level = plat_scmi_reset_assert_level,
	.deassert_level = plat_scmi_reset_deassert_level,
	.get_name = plat_scmi_reset_get_name,
};

static void get_scmi_resets(void)
{
	size_t i = 0;

	for (i = 0; i < ARRAY_SIZE(stm32_scmi_reset); i++) {
		struct stm32_scmi_rd *scmi_reset = stm32_scmi_reset + i;
		struct rstctrl *rstctrl = plat_resets + i;

		if (!scmi_reset->is_exposed) {
			/* SCP-firmware needs a name */
			scmi_reset->name = "<reserved>";
			continue;
		}

		rstctrl->ops = &plat_scmi_reset_ops;

		scmi_reset->rstctrl_be =
			stm32mp_rcc_reset_id_to_rstctrl(scmi_reset->reset_id);
		assert(scmi_reset->rstctrl_be);

		scmi_reset->rstctrl = rstctrl;
	}
}

/*
 * Build the structure used to initialize SCP firmware.
 * We target a description from the DT so SCP firmware configuration
 * but we currently rely on local data (clock, reset) and 2 DT node
 * (voltage domain/regulators and DVFS).
 *
 * At early_init initcall level, prepare scpfw_cfg agent and channel parts.
 * At driver_init_late initcall level, get clock and reset devices.
 * When scmi-regulator-consumer driver probes, it adds the regulators.
 * When CPU OPP driver probesn it adds the DVFS part.
 */
static struct scpfw_config scpfw_cfg;

struct scpfw_config *scmi_scpfw_get_configuration(void)
{
	assert(scpfw_cfg.agent_count);

	return &scpfw_cfg;
}

TEE_Result scmi_scpfw_attach_notif(unsigned int agent_id,
				   unsigned int channel_id,
				   struct shared_mem *shm,
				   TEE_Result (**process)(unsigned int chan_id),
				   unsigned int *process_arg)
{
	if (agent_id < scpfw_cfg.agent_count) {
		struct scpfw_agent_config *agent_cfg =
			scpfw_cfg.agent_config + agent_id;

		if (channel_id < agent_cfg->channel_count) {
			struct scpfw_channel_config *channel_cfg =
				agent_cfg->channel_config + channel_id;

			*process = &scmi_server_smt_process_thread;
			*process_arg = channel_cfg->mailbox_idx;

			channel_cfg->shm = *shm;

			return TEE_SUCCESS;
		}
	}

	return TEE_ERROR_BAD_PARAMETERS;
}

static TEE_Result scmi_scpfw_cfg_early_init(void)
{
	unsigned int mailbox_idx = 0;
	unsigned int index = 0;
	unsigned int i = 0;
	unsigned int j = 0;

	scpfw_cfg.agent_count = 1;

	if (IS_ENABLED(CFG_SCMI_CORTEXM_AGENT))
		scpfw_cfg.agent_count += 1;

	scpfw_cfg.agent_config = calloc(scpfw_cfg.agent_count,
					sizeof(*scpfw_cfg.agent_config));

	scpfw_cfg.agent_config[index].name = "agent_a35";
	scpfw_cfg.agent_config[index].agent_id = index + 1;
	scpfw_cfg.agent_config[index].channel_count =
		ARRAY_SIZE(scmi_channel_a35_ns);
	scpfw_cfg.agent_config[index].channel_config =
		calloc(scpfw_cfg.agent_config[index].channel_count,
		       sizeof(*scpfw_cfg.agent_config[index].channel_config));
	index++;

	if (IS_ENABLED(CFG_SCMI_CORTEXM_AGENT)) {
		scpfw_cfg.agent_config[index].name = "agent_m33";
		scpfw_cfg.agent_config[index].agent_id = index + 1;
		scpfw_cfg.agent_config[index].channel_count =
			ARRAY_SIZE(scmi_channel_m33_ns);
		scpfw_cfg.agent_config[index].channel_config =
			calloc(scpfw_cfg.agent_config[index].channel_count,
			       sizeof(*scpfw_cfg.agent_config[index]
						.channel_config));
		index++;
	}

	assert(scpfw_cfg.agent_count == index);

	for (i = 0; i < scpfw_cfg.agent_count; i++)
		for (j = 0; j < scpfw_cfg.agent_config[i].channel_count; j++)
			scpfw_cfg.agent_config[i]
				 .channel_config[j]
				 .mailbox_idx = mailbox_idx++;

	return TEE_SUCCESS;
}

early_init(scmi_scpfw_cfg_early_init);

static void scmi_scpfw_cfg_init_channel(const char *name,
					struct scpfw_agent_config *agent_config,
					const struct channel_resources
						channels_res[])
{
	size_t i = 0;
	size_t j = 0;

	for (i = 0; i < agent_config->channel_count; i++) {
		struct channel_resources chan_res = channels_res[i];
		struct scpfw_channel_config *channel_cfg =
			agent_config->channel_config + i;

		channel_cfg->name = name;

		channel_cfg->clock_count = chan_res.clock_count;
		channel_cfg->clock = calloc(channel_cfg->clock_count,
					    sizeof(*channel_cfg->clock));
		for (j = 0; j < channel_cfg->clock_count; j++) {
			channel_cfg->clock[j] = (struct scmi_clock){
				.name = chan_res.clock[j].name,
				.clk = chan_res.clock[j].clk,
				/* Default OFF for RIF issues */
				.enabled = false,
			};
		}

		channel_cfg->reset_count = chan_res.rd_count;
		channel_cfg->reset = calloc(channel_cfg->reset_count,
					    sizeof(*channel_cfg->reset));
		for (j = 0; j < channel_cfg->reset_count; j++) {
			channel_cfg->reset[j] = (struct scmi_reset){
				.name = chan_res.rd[j].name,
				.rstctrl = chan_res.rd[j].rstctrl,
			};
		}

		channel_cfg->pd_count = chan_res.pd_count;
		if (channel_cfg->pd_count) {
			channel_cfg->pd = calloc(channel_cfg->pd_count,
						 sizeof(*channel_cfg->pd));
			assert(channel_cfg->pd);

			for (j = 0; j < channel_cfg->pd_count; j++) {
				struct clk *clk = stm32mp_rcc_clock_id_to_clk(
					chan_res.pd[j].clock_id);
				struct regulator *regu = NULL;

				if (chan_res.pd[j].regu_name) {
					regu = regulator_get_by_name(
						chan_res.pd[j].regu_name);

					if (!regu) {
						EMSG("Regulator %s not found "
						     "for %s power domain",
						     chan_res.pd[j].regu_name,
						     chan_res.pd[j].name);
						panic();
					}
				}

				if (!clk)
					DMSG("Clock ID %ld not found for %s "
					     "power domain",
					     chan_res.pd[j].clock_id,
					     chan_res.pd[j].name);

				channel_cfg->pd[j] = (struct scmi_pd){
					.name = chan_res.pd[j].name,
					.clk = clk,
					.regu = regu,
				};
			}
		}
	}
}

static TEE_Result scmi_scpfw_cfg_init(void)
{
	get_scmi_clocks();
	get_scmi_resets();

	scmi_scpfw_cfg_init_channel("channel_a35_ns",
				    &scpfw_cfg.agent_config[0],
				    scmi_channel_a35_ns);

	if (IS_ENABLED(CFG_SCMI_CORTEXM_AGENT)) {
		scmi_scpfw_cfg_init_channel("channel_m33_ns",
					    &scpfw_cfg.agent_config[1],
					    scmi_channel_m33_ns);
	}

	/* DVFS will be populated from cpu_opp driver */

	if (IS_ENABLED(CFG_SCMI_SERVER_REGULATOR_CONSUMER)) {
		TEE_Result res = TEE_ERROR_GENERIC;

